
#########################################################
####    This sdc is generated by topgun automatically
####    topgun input files including:
####        - topgun_cfg.yaml
####        - sdc_info.yaml
#########################################################

# freq_scale is used for frequency flexibly scaling up or down
if { [info exists env(FREQ_SCALE)] } {set freq_scale $env(FREQ_SCALE) } else { set freq_scale 1.0}
set CORE_CLK_AON_FREQ                [expr 1500*$freq_scale]; # period is 0.666667
set JTAG_TCK_FREQ                    [expr 10*$freq_scale]; # period is 100.000000

# clock definition for core_clk_aon
set core_clk_aon_period [expr 1000.0/$CORE_CLK_AON_FREQ]
set core_clk_aon_edge_list "0.0 [expr $core_clk_aon_period/2.0]"
create_clock -name core_clk_aon -waveform $core_clk_aon_edge_list -period $core_clk_aon_period [get_ports core_clk_aon]
set_clock_uncertainty -setup [expr $core_clk_aon_period*0.2] [get_clocks core_clk_aon]
set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports clkgate_bypass]

set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports core_reset_n]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports dbg_toggle_a]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports dcache_disable_init]

set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports hart_id]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports i_dbg_stop]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports icache_disable_init]

set_input_delay [expr $core_clk_aon_period*0.3] -clock core_clk_aon -add_delay [get_ports irq_i]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arready]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awready]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_bid]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_bresp]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_bvalid]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_clk_en]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_rdata]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_rid]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_rlast]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_rresp]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_rvalid]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_wready]

set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports mmu_tlb_disable_init]

set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports mtime_toggle_a]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_addr]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_mmode]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_read]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_size]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_smode]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_valid]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_wdata]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_wmask]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_rsp_ready]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_mem_holdup]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_req_ready]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_rsp_1cyc_dat]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_rsp_1cyc_type]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_rsp_multicyc_dat]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_rsp_multicyc_err]

set_input_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_rsp_multicyc_valid]

set_input_delay [expr $core_clk_aon_period*0.3] -clock core_clk_aon -add_delay [get_ports nmi]

set_input_delay [expr $core_clk_aon_period*0.6] -clock core_clk_aon -add_delay [get_ports override_dm_sleep]

set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports por_reset_n]

set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports reset_bypass]

set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports reset_vector]

set_input_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports rx_evt]

set_input_delay [expr $core_clk_aon_period*0.5] -clock core_clk_aon -add_delay [get_ports stop_on_reset]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports core_sleep_value]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports core_wfi_mode]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports dbg_stoptime]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports hart_halted]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_bjp_taken]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_cause]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_cmt_ena]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_dmode]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_iaddr]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_iexception]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_instr]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_interrupt]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_ivalid]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_priv]

set_output_delay [expr $core_clk_aon_period*0.01] -clock core_clk_aon -add_delay [get_ports i0_trace_tval]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_araddr]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arburst]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arcache]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arid]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arlen]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arlock]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arprot]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arsize]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_arvalid]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awaddr]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awburst]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awcache]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awid]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awlen]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awlock]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awprot]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awsize]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_awvalid]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_bready]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_rready]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_wdata]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_wlast]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_wstrb]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports mem_wvalid]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_cmd_ready]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_rsp_err]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_rsp_rdata]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_icb_rsp_valid]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_req_instr]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_req_mmode]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_req_rs1]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_req_rs2]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_req_smode]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_req_valid]

set_output_delay [expr $core_clk_aon_period*0.2] -clock core_clk_aon -add_delay [get_ports nice_rsp_multicyc_ready]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports sysrstreq]

set_output_delay [expr $core_clk_aon_period*0.7] -clock core_clk_aon -add_delay [get_ports tx_evt]


# clock definition for jtag_TCK
set jtag_TCK_period [expr 1000.0/$JTAG_TCK_FREQ]
set jtag_TCK_edge_list "0.0 [expr $jtag_TCK_period/2.0]"
create_clock -name jtag_TCK -waveform $jtag_TCK_edge_list -period $jtag_TCK_period [get_ports jtag_TCK]
set_clock_uncertainty -setup [expr $jtag_TCK_period*0.2] [get_clocks jtag_TCK]
set_input_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_TDI]

set_input_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_TMS_in]

set_input_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_dwbypass]

set_output_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_BK_TMS]

set_output_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_DRV_TDO]

set_output_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_DRV_TMS]

set_output_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_TDO]

set_output_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_TMS_out]

set_output_delay [expr $jtag_TCK_period*0.4] -clock jtag_TCK -add_delay [get_ports jtag_dwen]

set_case_analysis 0 [get_ports {reset_bypass}]

set_case_analysis 0 [get_ports {clkgate_bypass}]


set_clock_groups -asynchronous -name async_grp0 -group {core_clk_aon} -group {jtag_TCK}

set_false_path -through [get_cells {u_core/u_dbg_top/u_dbg_u_dm_u_dm_handbuf_wrapper_dm_map_package_hand_buf_*}] -to [get_cells {u_core/u_dbg_top/u_dbg_u_dm_dmi_rdata_dfflr/qout_r_reg*}]

set_ideal_network [get_ports {core_reset_n}]

set_ideal_network [get_ports {por_reset_n}]

set_multicycle_path  3 -setup  -from [get_ports hart_id] -to [get_clocks core_clk_aon]

set_multicycle_path  2 -hold  -from [get_ports hart_id] -to [get_clocks core_clk_aon]

set_multicycle_path  3 -setup  -from [get_ports mtime_toggle_a] -to [get_clocks core_clk_aon]

set_multicycle_path  2 -hold  -from [get_ports mtime_toggle_a] -to [get_clocks core_clk_aon]

set_multicycle_path  3 -setup  -from [get_ports stop_on_reset] -to [get_clocks core_clk_aon]

set_multicycle_path  2 -hold  -from [get_ports stop_on_reset] -to [get_clocks core_clk_aon]

set_multicycle_path  3 -setup  -from [get_ports icache_disable_init] -to [get_clocks core_clk_aon]

set_multicycle_path  2 -hold  -from [get_ports icache_disable_init] -to [get_clocks core_clk_aon]

set_multicycle_path  3 -setup  -from [get_ports dcache_disable_init] -to [get_clocks core_clk_aon]

set_multicycle_path  2 -hold  -from [get_ports dcache_disable_init] -to [get_clocks core_clk_aon]

set_multicycle_path  3 -setup  -from [get_ports mmu_tlb_disable_init] -to [get_clocks core_clk_aon]

set_multicycle_path  2 -hold  -from [get_ports mmu_tlb_disable_init] -to [get_clocks core_clk_aon]

